Hashi/NomadConsul/cloudlab/results/nomad-sn-wrk-user.txt
Running 30s test @ http://128.110.219.70:8080/wrk2-api/user-timeline/read
  4 threads and 8 connections
  Thread calibration: mean lat.: 1.165ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.144ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.127ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.121ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.14ms  266.50us   1.89ms   67.39%
    Req/Sec    52.45     75.57   300.00     90.50%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.13ms
 75.000%    1.33ms
 90.000%    1.47ms
 99.000%    1.89ms
 99.900%    2.43ms
 99.990%    2.68ms
 99.999%    2.68ms
100.000%    2.68ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.539     0.000000            1         1.00
       0.806     0.100000          406         1.11
       0.895     0.200000          800         1.25
       0.973     0.300000         1206         1.43
       1.042     0.400000         1602         1.67
       1.126     0.500000         1996         2.00
       1.169     0.550000         2201         2.22
       1.204     0.600000         2398         2.50
       1.245     0.650000         2593         2.86
       1.281     0.700000         2794         3.33
       1.325     0.750000         2993         4.00
       1.343     0.775000         3095         4.44
       1.362     0.800000         3194         5.00
       1.386     0.825000         3292         5.71
       1.409     0.850000         3391         6.67
       1.437     0.875000         3493         8.00
       1.452     0.887500         3542         8.89
       1.467     0.900000         3595        10.00
       1.481     0.912500         3640        11.43
       1.499     0.925000         3690        13.33
       1.522     0.937500         3740        16.00
       1.535     0.943750         3765        17.78
       1.549     0.950000         3790        20.00
       1.565     0.956250         3815        22.86
       1.585     0.962500         3840        26.67
       1.603     0.968750         3865        32.00
       1.617     0.971875         3877        35.56
       1.642     0.975000         3890        40.00
       1.652     0.978125         3902        45.71
       1.673     0.981250         3916        53.33
       1.714     0.984375         3927        64.00
       1.734     0.985938         3934        71.11
       1.809     0.987500         3940        80.00
       1.866     0.989062         3946        91.43
       1.911     0.990625         3952       106.67
       2.018     0.992188         3958       128.00
       2.035     0.992969         3961       142.22
       2.065     0.993750         3965       160.00
       2.121     0.994531         3968       182.86
       2.163     0.995313         3971       213.33
       2.175     0.996094         3974       256.00
       2.191     0.996484         3975       284.44
       2.237     0.996875         3977       320.00
       2.259     0.997266         3979       365.71
       2.283     0.997656         3980       426.67
       2.357     0.998047         3982       512.00
       2.357     0.998242         3982       568.89
       2.393     0.998437         3983       640.00
       2.417     0.998633         3984       731.43
       2.433     0.998828         3985       853.33
       2.463     0.999023         3986      1024.00
       2.463     0.999121         3986      1137.78
       2.463     0.999219         3986      1280.00
       2.465     0.999316         3987      1462.86
       2.465     0.999414         3987      1706.67
       2.657     0.999512         3988      2048.00
       2.657     0.999561         3988      2275.56
       2.657     0.999609         3988      2560.00
       2.657     0.999658         3988      2925.71
       2.657     0.999707         3988      3413.33
       2.679     0.999756         3989      4096.00
       2.679     1.000000         3989          inf
#[Mean    =        1.138, StdDeviation   =        0.267]
#[Max     =        2.678, Total count    =         3989]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5993 requests in 30.00s, 1.14MB read
Requests/sec:    199.75
Transfer/sec:     38.82KB